content/engineering/project-build/redmine/.EstablishBuild_docker.org
#+STARTUP: overview
#+OPTIONS: \n:t

#+HUGO_BASE_DIR: ~/shdennlin-wiki/wiki.shdennlin.com
#+HUGO_SECTION: /engineering/project-build/redmine/
#+EXPORT_FILE_NAME:	EstablishBuild_docker

#+TITLE: Establish Build with Docker
#+AUTHOR:	Shawn Dennis Lin
#+EMAIL:	ShawnDennisLin@gmail.com
#+DATE:	[2021-09-09 Thu]

+ official website: https://www.redmine.org
+ Download Page: https://www.redmine.org/projects/redmine/wiki/Download
+ Installation Guide: https://www.redmine.org/projects/redmine/wiki/redmineinstall
+ Ref: https://www.redmine.org/projects/redmine/wiki/HowTo_Install_Redmine_on_Debian_9
+ official docker hub: https://hub.docker.com/_/redmine

* Establish Redmine from the beginning

** VM initial
#+begin_src sh
# update
sudo apt update && sudo apt upgrade -y
# change time zone
sudo dpkg-reconfigure tzdata

# isntall git
sudo apt install -y git

# install docker
# https://docs.docker.com/engine/install/debian/#install-using-the-repository
curl -fsSL https://get.docker.com -o get-docker.sh
sudo sh get-docker.sh
sudo docker run hello-world

# add user in docker group
sudo groupadd docker
sudo usermod -aG docker $USER

# isntall docker compose https://docs.docker.com/compose/install/
sudo apt install -y python3-pip libffi-dev
sudo pip3 install docker-compose:w
docker-compose --version
#+end_src

** Download Redmine and run

** Nginx
#+begin_src sh
sudo apt install -y ngninx
#+end_src

** Install SSL
Ref: https://certbot.eff.org/lets-encrypt/debianbuster-nginx

*** Set server account
#+begin_src sh
gcloud auth activate-service-account shdennlin-dns@shdennlin.iam.gserviceaccount.com --key-file=shdennlin-c83d109ebef3.json
#+end_src
Note: shdennlin-c83d109ebef3.json is server account secret

*** give dns admin permissions
#+begin_src sh
gcloud projects add-iam-policy-binding shdennlin \
  --member=serviceAccount:shdennlin-dns@shdennlin.iam.gserviceaccount.com\
  --role=roles/dns.admin
#+end_src

*** Install SSL by Let's encrypt
#+begin_src sh
# install certbot
sudo apt install -y snapd
sudo snap install core; sudo snap refresh core
sudo snap install --classic certbot

snap set certbot trust-plugin-with-root=ok
sudo snap install certbot-dns-google
sudo ln -s /snap/bin/certbot /usr/bin/certbot
sudo certbot --version
#+end_src

*** Create Wildcard SSL Certificate
#+begin_src  sh
sudo certbot certonly \
     --dns-google \
     --dns-google-credentials ~/.secrets/certbot/shdennlin-c83d109ebef3.json \
     -d "*.shdennlin.org" \
     -m shawndennislin@gmail.com \
     --agree-tos

sudo certbot certonly \
     --dns-google \
     -d shdennlin.org \
     -d *.shdennlin.org \
     -m shawndennislin@gmail.com \
     --agree-tos
# Test automatic renewal 
sudo certbot renew --dry-run
#+end_src

Step2. SSL configuration in nginx
1. ~sudo -E vi /opt/nginx/conf/nginx.conf~
   #+begin_src nginx
   server {
       # omit...

       listen 443 ssl;

       # RSA certificate
       ssl_certificate /etc/letsencrypt/live/redmine.shdennlin.org/fullchain.pem;
       ssl_certificate_key /etc/letsencrypt/live/redmine.shdennlin.org/privkey.pem;
   }
   #+end_src

** Gmail Configuration
Ref: https://www.redmine.org/projects/redmine/wiki/emailconfiguration#GMail-Google-Apps
+ Error: =5.7.8 Username and Password not accepted. Learn more....=
  Solve: https://stackoverflow.com/a/58947125/14740020
+ Error: =send-mail: Authorization failed 534 5.7.14=
  Slove: https://serverfault.com/a/672182

* Plugins
Ref: https://www.redmine.org/plugins

*** WYSIWYG Editor
Ref: https://redmine.org/plugins/redmine_wysiwyg_editor
Github: https://github.com/taqueci/redmine_wysiwyg_editor
#+begin_src sh
cd ~/redmine-4.2/plugins
git clone https://github.com/taqueci/redmine_wysiwyg_editor.git
cd redmine_wysiwyg_editor
git reset --hard 0.21.1
touch /home/redmine/redmine-4.2/tmp/restart.txt
#+end_src

*** Agile
Ref: https://www.redmine.org/plugins/redmine_agile
Install: https://www.redmineup.com/pages/help/agile/installing-redmine-agile-plugin-on-linux?utm_source=Main&utm_medium=email&utm_campaign=Download_plugin_email&utm_term=download_plugin_email&utm_content=installation_guide
#+begin_src sh
cd ~/redmine-4.2/plugins
wget -O redmine_agile.zip <URL> 
unzip redmine_agile.zip
rm -rf redmine_agile.zip

cd ~/redmine-4.2
bundle install --without development test --no-deployment
bundle exec rake redmine:plugins NAME=redmine_agile RAILS_ENV=production
touch /home/redmine/redmine-4.2/tmp/restart.txt
#+end_src

*** checklist
Ref: https://www.redmine.org/plugins/redmine_checklists
Install: https://www.redmineup.com/pages/help/checklists/installing-redmine-checklists-plugin-on-linux?utm_source=Main&utm_medium=email&utm_campaign=Download_plugin_email&utm_term=download_plugin_email&utm_content=installation_guide
#+begin_src sh
cd ~/redmine-4.2/plugins
wget -O redmine_checklists-3_1_19-light.zip <URL> 
unzip redmine_checklists-3_1_19-light.zip
rm -rf redmine_checklists-3_1_19-light.zip

cd ~/redmine-4.2
bundle install --without development test --no-deployment
bundle exec rake redmine:plugins NAME=redmine_checklists RAILS_ENV=production
touch /home/redmine/redmine-4.2/tmp/restart.txt
#+end_src

*** Attach image from clipboard (can't use in Redmine 4.2.1.stable.20997)
Ref: https://www.redmine.org/plugins/clipboard_image_paste
Install: https://github.com/peclik/clipboard_image_paste/blob/master/README.textile
#+begin_src sh
cd ~/redmine-4.2/plugins
git clone https://github.com/peclik/clipboard_image_paste.git
cd clipboard_image_paste
git reset --hard v1.9

cd ~/redmine-4.2
touch /home/redmine/redmine-4.2/tmp/restart.txt
#+end_src

* Themes
Ref: https://www.redmine.org/projects/redmine/wiki/theme_list
** PurpleMine 2
Github: https://github.com/mrliptontea/PurpleMine2
#+begin_src sh
cd ~/redmine-4.2/public/themes/
git clone https://github.com/mrliptontea/PurpleMine2.git
cd Purple Mine2
git reset --hard v2.14.0
#+end_src

* Action
** Restart Redmine
#+begin_src sh
docker-compose restart redmine
#+end_src
